# SQL Practice Case

This repo wraps up my IYKRA's SQL and Python Practice Case submission, but , before I jumped to the main topic, I will explain how to run **SQL** in **Jupyter Notebook** with **PostgreSQL** database software.


## How to run SQL in Jupyter Notebook with PostgreSQL database software

First, you need to install these libraries:

1. ipython-sql
2. psycopg2
3. sqlalchemy

So, it would be something like this:

In [1]:
# pip install ipython-sql
# pip install psycopg2
# pip install sqlalchemy

Now, we will use the sqlalchemy library to create an engine needed to connect to the database.

In [2]:
import sqlalchemy

To connect to the database you need to provide a connection string. The typical form of a database URL using SQLAlchemy is:

#### dialect+driver://username:password@host:port/database

For my case, it would be something like this:

In [3]:
sqlalchemy.create_engine('postgresql://postgres:fellowship@localhost/dvdrental')

Engine(postgresql://postgres:***@localhost/dvdrental)

Now, we just need to load the sql module by using this command:

In [4]:
%load_ext sql

And connect to the database with a connection string specified earlier, like this:

In [5]:
%sql postgresql://postgres:fellowship@localhost/dvdrental

To execute sql queries in jupyter cell, you just need to add **'%sql'** (one percent sign) prefix for single-line queries or **'%%sql'** (two percent signs) prefix for multi-line queries.

## SQL Practice Case

In this practice case, there are 7 cases about DVD rental that need to be solved using SQL queries. You can find the DVD rental database here: https://www.postgresqltutorial.com/postgresql-sample-database/.

Here are the questions:

1. A customer wants to know films about "astronaut". How many recommendations you could give for him?
2. How many films that have "R" rating, and a replacement cost between 5 and 15 dollar?
3. We have two staff memberss with staff ID 1 and 2. We want to give a bonus to the staff member that handled the most payments. How many payments did each staff member handle? How much was the total amount processed by each staff member?
4. Corporate headquarter is auditing the stores, they want to know the average replacement cost of movies by rating.
5. We want to send coupons to the 5 customers who have spent the most amount of money. Get the customer's name, email, and their spent amount!
6. We want to audit our stock of films in all of our stores. How many copies of each movie in each store do we have?
7. We want to know which customers are eligible for our platinum credit card. The requirements are that the customer must has at least a total of 40 transactions. Get the customers' name and email who are eligible for our platinum card!

### Question #1

For the first case, I counted the number of movies that contain the word 'stronaut' in its description. The reason why I did not use the word 'Astronaut' or 'astronaut' is I did not want to deal with each word's capitalization format. Here is my query for the first question:

In [6]:
%%sql

select count(title) as number_of_astronaut_movies
from film
where description like '%stronaut%'

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(78,)]

It turns out that 78 movies are about astronaut. Now, let's see 5 of them:

In [7]:
%%sql

select title, release_year, description
from film
where description like '%stronaut%'
order by title
limit 5

 * postgresql://postgres:***@localhost/dvdrental
5 rows affected.

[('Alley Evolution', 2006, 'A Fast-Paced Drama of a Robot And a Composer who must Battle a Astronaut in New Orleans'),
 ('American Circus', 2006, 'A Insightful Drama of a Girl And a Astronaut who must Face a Database Administrator in A Shark Tank'),
 ('Angels Life', 2006, 'A Thoughtful Display of a Woman And a Astronaut who must Battle a Robot in Berlin'),
 ('Anonymous Human', 2006, 'A Amazing Reflection of a Database Administrator And a Astronaut who must Outrace a Database Administrator in A Shark Tank'),
 ('Bikini Borrowers', 2006, 'A Astounding Drama of a Astronaut And a Cat who must Discover a Woman in The First Manned Space Station')]

### Question #2

In this question, I selected 'title', 'release_year', 'replacement_cost', and 'rating' column, then I put two conditions with 'where' clause, which are the movie's rating is R, and the replacement cost for each film is between 5 and 15 dollars. Here's my query for the second question with its output:

In [8]:
%%sql

select title, release_year, replacement_cost, rating
from film
where rating = 'R' and replacement_cost between 5 and 15
order by title
limit 5

 * postgresql://postgres:***@localhost/dvdrental
5 rows affected.

[('Alone Trip', 2006, Decimal('14.99'), 'R'),
 ('Anaconda Confessions', 2006, Decimal('9.99'), 'R'),
 ('Apocalypse Flamingos', 2006, Decimal('11.99'), 'R'),
 ('Boogie Amelie', 2006, Decimal('11.99'), 'R'),
 ('Boulevard Mob', 2006, Decimal('11.99'), 'R')]

### Question #3

In the third question, I used a subquery to connect the 'payment' table with the 'staff' table. From the 'payment' table, I took the 'staff_id' column. Meanwhile, from the 'payment' table I counted each staff's transactions and also calculated each staff's total payment amount. Here's my query with its output:

In [9]:
%%sql

select  staff_id,
        (select concat(first_name, ' ', last_name)
        from staff s
        where p.staff_id = s.staff_id) as staff_name,
        count(payment_id) as number_of_transactions,
        sum(amount) as total_payment_amount
from payment p
group by staff_id
order by number_of_transactions desc

 * postgresql://postgres:***@localhost/dvdrental
2 rows affected.

[(2, 'Jon Stephens', 7304, Decimal('31059.92')),
 (1, 'Mike Hillyer', 7292, Decimal('30252.12'))]

### Question #4

For this question, I just need to calculate each movie's replacement cost average and grouped it by its rating. I also rounded the 'average_replacement_cost' column to two decimal numbers. Here's my query with its output for the fourth question:

In [14]:
%%sql

select rating, 
round(avg(replacement_cost), 2) as average_replacement_cost
from film
group by rating
order by average_replacement_cost desc

 * postgresql://postgres:***@localhost/dvdrental
5 rows affected.

[('PG-13', Decimal('20.40')),
 ('R', Decimal('20.23')),
 ('NC-17', Decimal('20.14')),
 ('G', Decimal('20.12')),
 ('PG', Decimal('18.96'))]

### Question #5

For this question, I used a subquery to connect the 'payment' table with the 'customer' table. From the 'payment' table, I calculated the total amount spent for each customer. I extracted the customer's name and email from the 'customer' table. To show the top five customers with the most amount spent, I used the 'order by' clause in descending order and limit it to only five records using the 'limit' clause. Here's my query and its output for the fifth question:

In [11]:
%%sql

select concat(first_name, ' ', last_name) as customer_name,
        email,
        (select sum(amount)
        from payment p
        where c.customer_id = p.customer_id) as spent_amount
from customer c
order by spent_amount desc
limit 5

 * postgresql://postgres:***@localhost/dvdrental
5 rows affected.

[('Eleanor Hunt', 'eleanor.hunt@sakilacustomer.org', Decimal('211.55')),
 ('Karl Seal', 'karl.seal@sakilacustomer.org', Decimal('208.58')),
 ('Marion Snyder', 'marion.snyder@sakilacustomer.org', Decimal('194.61')),
 ('Rhonda Kennedy', 'rhonda.kennedy@sakilacustomer.org', Decimal('191.62')),
 ('Clara Shaw', 'clara.shaw@sakilacustomer.org', Decimal('189.60'))]

### Question #6

For this question, I used a subquery to connect the 'film' table with the 'inventory' table. From the 'film' table I took each movie's title. From the 'inventory' table, I used the 'count' clause to count the number of copies for each film. Then, I grouped it by the 'store_id' and 'film_id' column to see the number of copies for each film in each store. Here's my query and its first five records:

In [12]:
%%sql

select  store_id,
        (select title
        from film f
        where f.film_id = i.film_id),
        count(inventory_id) as number_of_copies
from inventory i
group by store_id, film_id
order by title, store_id
limit 5

 * postgresql://postgres:***@localhost/dvdrental
5 rows affected.

[(1, 'Academy Dinosaur', 4),
 (2, 'Academy Dinosaur', 4),
 (2, 'Ace Goldfinger', 3),
 (2, 'Adaptation Holes', 4),
 (1, 'Affair Prejudice', 4)]

### Question #7

For the last question, I used a combination of a subquery and the 'join' clause. In the subquery, I counted the 'payment_id' records for each customer to get the 'number_of_transactions' column. Then, I joined it with the 'customer' column to extract the customer's name and email. Lastly, I put a condition to filter the 'number_of_transactions' column, so I can get the customers' name and email who's the number of transactions is greater than 40. Here's my query and its output:

In [13]:
%%sql

select  concat(first_name, ' ', last_name) as customer_name, 
        email, number_of_transactions
from customer c
left join  (select customer_id, count(payment_id) as number_of_transactions
            from payment
            group by customer_id) p
    on p.customer_id = c.customer_id
where number_of_transactions >= 40
order by number_of_transactions desc

 * postgresql://postgres:***@localhost/dvdrental
3 rows affected.

[('Eleanor Hunt', 'eleanor.hunt@sakilacustomer.org', 45),
 ('Karl Seal', 'karl.seal@sakilacustomer.org', 42),
 ('Clara Shaw', 'clara.shaw@sakilacustomer.org', 40)]

## Python Practice Case

In this practice case, I need to make a function that introduces my name, address, and date of birth and print them out in one sentence. So, here's my function which called 'introduction' and its output:

In [15]:
def introduction(name, address, dob):
    return print("My name is", name + ", I live in", address + ", I was born on", dob + ".")

In [16]:
introduction('Wikan', 'Yogyakarta', 'May 13th')

My name is Wikan, I live in Yogyakarta, I was born on May 13th.

## References

1. https://towardsdatascience.com/heres-how-to-run-sql-in-jupyter-notebooks-f26eb90f3259
2. https://medium.com/python-in-plain-english/how-to-run-and-analyze-sql-queries-with-pandas-in-jupyter-7f02503cf46